import 'package:washer_tag/models/quiz.dart';

const List<Quiz> quizList = [
  Quiz(
    image: "images/100.gif",
    options: ["つけ置き禁止", "家庭での洗濯禁止", "洗濯禁止", "手洗い禁止"],
    correctIndex: 1,
  ),
  Quiz(
    image: "images/110.gif",
    options: [
      "つけ置き可",
      "液温は40℃を限度とし、手洗いができる",
      "液温は60℃を限度とし、手洗いができる",
      "液温の限度はなく、手洗い可"
    ],
    correctIndex: 1,
  ),
  Quiz(
    image: "images/130.gif",
    options: [
      "液温は30 ℃を限度とし、洗濯機で弱い処理が出来る",
      "液温は30 ℃を限度とし、手洗い出来る",
      "液温は30 ℃を限度とし、洗濯機で非常に弱い処理が出来る",
      "液温は30 ℃を限度とし、洗濯機で洗濯出来る",
    ],
    correctIndex: 3,
  ),
  Quiz(
    image: "images/131.gif",
    options: [
      "液温は30 ℃を限度とし、洗濯機で弱い処理が出来る",
      "液温は30 ℃を限度とし、手洗い出来る",
      "液温は30 ℃を限度とし、洗濯機で非常に弱い処理が出来る",
      "液温は30 ℃を限度とし、洗濯機で洗濯出来る",
    ],
    correctIndex: 0,
  ),
  Quiz(
    image: "images/132.gif",
    options: [
      "液温は30 ℃を限度とし、手洗い出来る",
      "液温は30 ℃を限度とし、洗濯機で洗濯出来る",
      "液温は30 ℃を限度とし、洗濯機で弱い処理が出来る",
      "液温は30 ℃を限度とし、洗濯機で非常に弱い処理が出来る",
    ],
    correctIndex: 3,
  ),
  Quiz(
    image: "images/140.gif",
    options: [
      "液温は40 ℃を限度とし、手洗い出来る",
      "液温は40 ℃を限度とし、洗濯機で洗濯出来る",
      "液温は40 ℃を限度とし、洗濯機で弱い処理が出来る",
      "液温は40 ℃を限度とし、洗濯機で非常に弱い処理が出来る",
    ],
    correctIndex: 1,
  ),
  Quiz(
    image: "images/141.gif",
    options: [
      "液温は40 ℃を限度とし、手洗い出来る",
      "液温は40 ℃を限度とし、洗濯機で洗濯出来る",
      "液温は40 ℃を限度とし、洗濯機で弱い処理が出来る",
      "液温は40 ℃を限度とし、洗濯機で非常に弱い処理が出来る",
    ],
    correctIndex: 2,
  ),
  Quiz(
    image: "images/142.gif",
    options: [
      "液温は40 ℃を限度とし、手洗い出来る",
      "液温は40 ℃を限度とし、洗濯機で洗濯出来る",
      "液温は40 ℃を限度とし、洗濯機で弱い処理が出来る",
      "液温は40 ℃を限度とし、洗濯機で非常に弱い処理が出来る",
    ],
    correctIndex: 3,
  ),
  Quiz(
    image: "images/150.gif",
    options: [
      "液温は50 ℃を限度とし、手洗い出来る",
      "液温は50 ℃を限度とし、洗濯機で洗濯出来る",
      "液温は50 ℃を限度とし、洗濯機で弱い処理が出来る",
      "液温は50 ℃を限度とし、洗濯機で非常に弱い処理が出来る",
    ],
    correctIndex: 1,
  ),
  Quiz(
    image: "images/151.gif",
    options: [
      "液温は50 ℃を限度とし、手洗い出来る",
      "液温は50 ℃を限度とし、洗濯機で洗濯出来る",
      "液温は50 ℃を限度とし、洗濯機で弱い処理が出来る",
      "液温は50 ℃を限度とし、洗濯機で非常に弱い処理が出来る",
    ],
    correctIndex: 2,
  ),
  Quiz(
    image: "images/160.gif",
    options: [
      "液温は60 ℃を限度とし、手洗い出来る",
      "液温は60 ℃を限度とし、洗濯機で洗濯出来る",
      "液温は60 ℃を限度とし、洗濯機で弱い処理が出来る",
      "液温は60 ℃を限度とし、洗濯機で非常に弱い処理が出来る",
    ],
    correctIndex: 1,
  ),
  Quiz(
    image: "images/161.gif",
    options: [
      "液温は60 ℃を限度とし、手洗い出来る",
      "液温は60 ℃を限度とし、洗濯機で洗濯出来る",
      "液温は60 ℃を限度とし、洗濯機で弱い処理が出来る",
      "液温は60 ℃を限度とし、洗濯機で非常に弱い処理が出来る",
    ],
    correctIndex: 2,
  ),
];
